# Explore Weather Trends
## Summary
Analyzing local and global temperature data and compare the temperature trends in Alexandria (EG) to overall global temperature trends.

## Importing Libraries

In [7]:
from sqlalchemy import create_engine
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import numpy as np
import psycopg2

## Jupyter Magic Settings

In [2]:
%matplotlib inline
# Control the default size of figures
#%pylab inline
#pylab.rcParams['figure.figsize'] = (20, 9)   # Change the size of plots

In [3]:
postgres_engine = create_engine('postgresql+psycopg2://postgres:100100@localhost:5432/weather')

In [39]:
%reload_ext sql_magic
%config SQL.conn_name = 'postgres_engine'

In [46]:
%%read_sql
SELECT *
FROM city_data
LIMIT 5;

Query started at 04:03:38 PM Egypt Standard Time; Query executed in 0.01 m

In [47]:
%%read_sql
SELECT *
FROM global_data
LIMIT 5;

Query started at 04:03:39 PM Egypt Standard Time; Query executed in 0.00 m

In [43]:
%config SQL.output_result = False

In [63]:
%%read_sql data
SELECT COALESCE(l.year,g.year) AS year, l.avg_temp AS local_temp, g.avg_temp AS global_temp
FROM city_data AS l
FULL OUTER JOIN global_data AS g
ON l.year = g.year;

Query started at 04:20:13 PM Egypt Standard Time; Query executed in 0.00 m

In [64]:
data.tail()

       year  local_temp  global_temp
71308  2011       21.55         9.52
71309  2012       21.52         9.51
71310  2013       22.19         9.61
71311  2014         NaN         9.57
71312  2015         NaN         9.83

In [57]:
%%read_sql alex
WITH local_data AS (SELECT *
               FROM city_data
               WHERE city = 'Alexandria'
               AND country = 'Egypt')
SELECT l.year,
        ROUND(AVG(l.avg_temp) OVER (ORDER BY l.year ROWS BETWEEN 9 PRECEDING AND CURRENT ROW), 2) AS localMA10,
        ROUND(AVG(g.avg_temp) OVER (ORDER BY g.year ROWS BETWEEN 9 PRECEDING AND CURRENT ROW), 2) AS globalMA10,
        ROUND(AVG(l.avg_temp) OVER (ORDER BY l.year ROWS BETWEEN 29 PRECEDING AND CURRENT ROW), 2) AS localMA30,
        ROUND(AVG(g.avg_temp) OVER (ORDER BY g.year ROWS BETWEEN 29 PRECEDING AND CURRENT ROW), 2) AS globalMA30
FROM local_data AS l
JOIN global_data AS g
ON l.year = g.year;

Query started at 04:13:03 PM Egypt Standard Time; Query executed in 0.01 m

In [58]:
alex.tail()

     year  localma10  globalma10  localma30  globalma30
218  2009      21.31        9.49      20.85        9.19
219  2010      21.48        9.54      20.92        9.21
220  2011      21.45        9.55      20.93        9.22
221  2012      21.46        9.55      20.98        9.25
222  2013      21.48        9.56      21.03        9.27

In [59]:
def preprocessing(df):
    """Preprocesses data by filling missing values"""
    # Forward and Backward filling missing values
    df.fillna(method='ffill', inplace=True)
    df.fillna(method='bfill', inplace=True)

In [65]:
preprocessing(data)
data.tail()

       year  local_temp  global_temp
71308  2011       21.55         9.52
71309  2012       21.52         9.51
71310  2013       22.19         9.61
71311  2014       22.19         9.57
71312  2015       22.19         9.83